{
  "dishes":[
    {
        "label": "Hot",
        "featured": true,
        "_id": "5b6fda4b9ed40513bc8a571f",
        "name": "Uthappizza",
        "image": "images/000.png",
        "category": "mains",
        "price": 499,
        "description": "A unique combination of Indian Uthappam (pancake) and Italian pizza, topped with Cerignola olives, ripe vine cherry tomatoes, Vidalia onion, Guntur chillies and Buffalo Paneer.",
        "comments": [
            {
                "_id": "5b6fda4b9ed40513bc8a5725",
                "rating": 2,
                "comment": "The pizza was okay. Not the best I've had. I prefer Biaggio's on Flamingo / Fort Apache. The chef there can make a MUCH better NY style pizza. The pizzeria @ Cosmo was over priced for the quality and lack of personality in the food. Biaggio's is a much better pick if youre going for italian - family owned, home made recipes, people that actually CARE if you like their food. You dont get that at a pizzeria in a casino. I dont care what you say...",
                "author": "Tony",
                "createdAt": "2018-08-12T06:57:15.950Z",
                "updatedAt": "2018-08-12T06:57:15.950Z"
            },
            {
                "_id": "5b6fda4b9ed40513bc8a5724",
                "author": "Andy",
                "comment": "I went there twice and I am pretty happy with my haircut. The people are  really friendly. Would definitely go again.",
                "rating": 5,
                "createdAt": "2018-08-12T06:57:15.950Z",
                "updatedAt": "2018-08-12T06:57:15.950Z"
            },
            {
                "_id": "5b6fda4b9ed40513bc8a5723",
                "rating": 1,
                "comment": "Terrible. Dry corn bread. Rib tips were all fat and mushy and had no flavor. If you want bbq in this neighborhood go to john mulls roadkill grill. Trust me.",
                "author": "Paul",
                "createdAt": "2018-08-12T06:57:15.950Z",
                "updatedAt": "2018-08-12T06:57:15.950Z"
            },
            {
                "_id": "5b6fda4b9ed40513bc8a5722",
                "rating": 5,
                "comment": "Delicious healthy food. The steak is amazing. Fish and pork are awesome too. Service is above and beyond. Not a bad thing to say about this place. Worth every penny!",
                "author": "Summer",
                "createdAt": "2018-08-12T06:57:15.950Z",
                "updatedAt": "2018-08-12T06:57:15.950Z"
            },
            {
                "_id": "5b6fda4b9ed40513bc8a5721",
                "rating": 1,
                "comment": "This place sucks. The customer service is horrible. They dont serve food unless you order a pizza from a neighboring restaurant. Who does that? They dont control their crowd. Many times I've gone I've seen fights. The bartenders suck - I've almost got in a fight with one because she was a complete bitch. Refused to serve me a drink because she was \"busy\" celebrating her friends birthday BEHIND THE BAR. This place is ridiculous. I will NEVER go there again.. EVER.",
                "author": "Rick",
                "createdAt": "2018-08-12T06:57:15.950Z",
                "updatedAt": "2018-08-12T06:57:15.950Z"
            },
            {
                "_id": "5b6fda4b9ed40513bc8a5720",
                "rating": 5,
                "comment": "If you like Thai food, you have to try the original thai bbq. Their pad se ew is to DIE for. Their thai egg rolls are delicious. Basil beef will not let you down (its not on the menu anymore, you have to ask for it!) \n\nYes, the building is not as fancy as some other places. Yes, i've batted a fly off my plate more than once. Yes, I do NOT go to the bathroom their because I dont even WANT to know what it looks like... \n\nBUT.. the thai food is the best in town. The service rocks. And you can get a $25 gift cert. on Restaurant.com for $2. Can you beat that? I think NOT.\n\nThis is the only place my husband and I go for anniversarys, date nights, birthdays.. anything!! I recommend it to everyone I know. If you KNOW good thai food, go here.",
                "author": "Morty",
                "createdAt": "2018-08-12T06:57:15.950Z",
                "updatedAt": "2018-08-12T06:57:15.950Z"
            }
        ],
        "createdAt": "2018-08-12T06:57:15.952Z",
        "updatedAt": "2018-08-12T06:57:15.952Z",
        "__v": 0
    },
    {
        "label": "",
        "featured": false,
        "_id": "5b6fda4b9ed40513bc8a5726",
        "name": "Zucchipakoda",
        "image": "images/001.png",
        "category": "appetizer",
        "price": 199,
        "description": "Deep fried Zucchini coated with mildly spiced Chickpea flour batter accompanied with a sweet-tangy tamarind sauce",
        "comments": [
            {
                "_id": "5b6fda4b9ed40513bc8a572b",
                "author": "Andy",
                "comment": "Tapas seem to be all the hype recently. And it's easy to see why. Not only does it allow you to try more things on the menu, but it's also perfect for when you're  with a larger group. And that is just the reason why a couple of my friends and I headed to the Ossington area to try out Foxley, an Asian-Vietnamese inspired tapas house.\n\nThe restaurant ambiance doesn't mimic anything I typically associate with a traditional Vietnamese restaurant. It has a classier fine dining style of décor with ginger brick walls and soft lighting; it's a  perfect romantic date spot. In fact, we saw lots of couples there that night all dining on a few plates and enjoying wine.\n\nMy friends and I decided to follow suit, so we split a bottle of red and ordered the most interesting dishes that caught our eyes on the menu. This however, was a task easier said than done. The menu comes on a single-sided laminated sheet, with no pictures. It was hard to distinguish where the descriptions of one dish started and the next one ended. It felt a little like reading an essay! But once you get over the poor formatting, you'll be amazed by the variety of dishes that they offer. There is no shortage of exotic meats and dishes, like frog legs and beef hearts. But if you're not feeling that adventurous, rest assured they also do have many good old reliable classics, like deep fried shrimps, steamed mussels, and spring rolls.\n\nThe first dish that came was the Lamb and Duck Prosciutto Dumplings\" ($7). These were served hot,crunchy and  with jam packed with minced lamb stuffing. They're tasty, but nothing too special..\n\nNext came a Sea Bream Creviche with Yuzu and Shiso ($15). They're bite sizes pieces of thinly sliced sea bream sashimi, covered with coriander and some lime puree. I actually found them to be a little too citrusy for my liking, but it is undeniably fresh. It was paired well with the crunchy fried onions generously sprinkled on top.\n\nAfter that, a whole slew of dishes came at the same time, and it was difficult to figure out which one to dig into first; they all looked and smelled so appetizing! The Grilled Marinated Beef Short Ribs ($14) came on a small plate with about 3-4 pieces. A little too chewy for my liking, but it was at least well marinated and flavourful. In comparison, the Grilled Side Ribs with Caramelized Shallot Glaze ($9.00) were delicious. They were made up of two long pork ribs covered in a savory sweet glaze, with meat that fell right off the bone. We literally demolished that dish in a couple of seconds!\n\nIf you're a big fan of pork belly as I am, then you'll be in for a real treat at Foxley. They serve a Slow-braised Pork Belly in Muscatel Reduction ($15) with nicely marbled fat and cooked in a delicious smokey barbeque sauce ;it just melts in your mouth!\n\nAnd while all those dishes were great, my favourite of the night was the Grilled Beef Heart with Chili Lime Salsa ($8). We ordered it just to try something new, and it was the best decision of the night! It came nicely grilled on two skewers so that the hearts are slightly charred on the outside for flavour, and still tender on the inside. Don't be afraid to try this one, it actually doesn't taste as farfetched as it sounds!\n\nTo balance out all the meat we ordered, the chef recommended the Kale Salad with Pecorino Toscano and Lemon Dressing ($8). I love kale, so in my books this salad was definitely a good order. My only complaint was that the lemon vinaigrette was a bit too sour.\n\nUpon finishing up the meal, the first thought I had was that Foxley is not as \"Asian fusion\" as I had anticipated. There are some influences, but not nearly enough for me to notice the Asian aspect of the menu. That does not go to say that I didn't enjoy my meal though. While I found it was a little on the pricier side, I did enjoy the food and the romantically sophisticated atmosphere. Keep Foxley in your books for either your next date night venue or for a quiet relaxing dinner out with friends.",
                "rating": 4,
                "createdAt": "2018-08-12T06:57:15.950Z",
                "updatedAt": "2018-08-12T06:57:15.950Z"
            },
            {
                "_id": "5b6fda4b9ed40513bc8a572a",
                "author": "Tony",
                "comment": "Huge Apple Danishes! Unfortunatley huge doesnt mean better. \nSo what does Westmall Donuts have to offer? Here you can eat a fattening overpriced danish in a horribly old and decrepid space and wash it all down with a lousy tasting coffee.\nDo yourself and your wallet a favour and avoid it!",
                "rating": 1,
                "createdAt": "2018-08-12T06:57:15.950Z",
                "updatedAt": "2018-08-12T06:57:15.950Z"
            },
            {
                "_id": "5b6fda4b9ed40513bc8a5729",
                "author": "Mike",
                "comment": "The Bar with No Name recently opened up in the place where the ever-empty Z-Bar used to be, and the signs of them still working out the kinks of being a newly opened place are still there. It was fairly obvious that the space was still in the process of being turned into something else, and there was still a lot of remenants of Z-Bar to be found. I've been to Z-Bar once, and I couldn't really tell the difference between the two, except for the kick-ass, inviting new Bar With No Name sign out front.\n\nSimply put, No Name's staff are amazing, thoughtful, and exactly how food biz staff shoudl be. They were really concerned with making sure we had a good time, and because of them, our experience was good. Even though the place was busy, they still made time to chat with us and didnt make us feel rushed.\n\nNo Name's food menu was the standard bar fare. Burgers, wings, and fried foods were front and center, but despite the plainness of the menu, the food was hot, fresh, and served the way it should be.\n\nThe music in this place, however, really needs some improvements. We probably would have stayed for another drink if it wasn't for commercials blasted over the radio being the only form of entertainment. I asked if they could put some sattelite radio on, and I was told not to worry because a DJ was going to be playing soon. I left at 1030, and I never saw or heard a DJ, just Leon's, Loblaw's, and car commercials at full volume.\n\nIt does seem as though they rushed to open, and they probably could have used another week or two to get things together, but once they get it all worked out, this place stands a great chance at becoming the perfect neighbourhood hangout.\n\n*We plan to review again in two months.",
                "rating": 3,
                "createdAt": "2018-08-12T06:57:15.950Z",
                "updatedAt": "2018-08-12T06:57:15.950Z"
            },
            {
                "_id": "5b6fda4b9ed40513bc8a5728",
                "author": "Rock",
                "comment": "Delicious, friendly staff, cool atmosphere, all around great experience! They have a pretty great selection of crepes and omelettes, among other things. I enjoyed the Cherry Omelette (cherry tomatoes, swiss cheese, potato slices, and bacon) which was pretty big and cooked perfectly! Nice side salad and bread as well. Coffee was great and our server was warm and polite. Would recommend!",
                "rating": 5,
                "createdAt": "2018-08-12T06:57:15.950Z",
                "updatedAt": "2018-08-12T06:57:15.950Z"
            },
            {
                "_id": "5b6fda4b9ed40513bc8a5727",
                "author": "Morty",
                "comment": "Relatively new to the King West theatre district, and across the street from the Bell Lightbox is, Paese.  New to the neighbourhood, but not new to the restaurant scene, Paese has been operating out of their Bathurst street location since 1989.  Serving up Italian comfort food in a casual but sleek atmosphere, Paese might give longtime district resident Kit Kat some competition.\n\nWith a monochromatic colour scheme, butcher block tables and exposed brick, Paese is very welcoming, even for someone who happened to be dining alone (see: yours truly).\n\nMy server brought the customary bread to the table...but this was no ordinary bread and oil. The bread itself was warm and chewy with a pretzel like flavour.  It came with an olive, rosemary and thyme tapenade that was rich and salty.  I tried to stop after one slice, but failed miserably.  I managed to leave one out of the four slices on the plate but I'd be lying if I said I wasn't staring at it longingly throughout dinner.\n\nNext, came my Beet Caprese Salad ($13).  Grilled beets came topped with a generous portion of mozzarella di bufala, drizzled with pistachio pesto and sprinkled with pomegranate seeds.  The combination of flavours and textures worked well together, and it was just a very fresh salad overall. If seasons were characterized by salads this one would be spring.  It was filling enough to be my main course, but I wasn't done yet.\n\nAs full of bread and beets as I was, I couldn't wait for my cavatelli ($13).  Hand rolled and made with semolina it had a texture similar to gnocchi but it wasn't as filling.  The sauce was reminiscent of my grandmothers, and that's a compliment as although she wasn't Italian, she was married to one and had learned a thing or two over the years.\n\nI had initially sent away the wine menu, although I'm not sure why exactly.  Maybe it was an unexpected burst of responsibility on my part as it was a weekday afternoon and I had another review to do...but those are hardly excuses not to partake.  It's part of the job after all.  Either way, one of the resident sommeliers saw right through me and insisted on returning the wine menu to my table.  Smart man.\n\nPaese has an extensive wine list and while most can only be purchased by the bottle, they do have a comprehensive list that is sold by the glass.  Now I'm no expert on wine, but I do drink a lot of the stuff so I know what I like, and I like Amarone.  I was given a sample of a 2004 Fumanelli Amarone before committing to a full glass, after which I gave the go ahead for my server to fill 'er up.  Rich and full-bodied it was a great complement to my meal, but as far as I'm concerned it would be a great complement to anything...cheese, pasta, breakfast...\n\nBecause of its location, I probably won't make a repeat visit but I don't think Paese is having a hard time attracting other customers.  I would recommend it to anyone who wants to have a good and affordable meal with some vino before or after catching a show.",
                "rating": 3,
                "createdAt": "2018-08-12T06:57:15.950Z",
                "updatedAt": "2018-08-12T06:57:15.950Z"
            }
        ],
        "createdAt": "2018-08-12T06:57:15.953Z",
        "updatedAt": "2018-08-12T06:57:15.953Z",
        "__v": 0
    },
    {
        "label": "New",
        "featured": false,
        "_id": "5b6fda4b9ed40513bc8a572c",
        "name": "Vadonut",
        "image": "images/002.png",
        "category": "appetizer",
        "price": 199,
        "description": "A quintessential ConFusion experience, is it a vada or is it a donut?",
        "comments": [
            {
                "_id": "5b6fda4b9ed40513bc8a5731",
                "author": "Tony",
                "comment": "Chef Vallins redefines comfort food. A beautiful, intimate atmosphere that proudly displays everything Trevor has to offer is front and center only to the creative food. I'd recommend the Truffle Poutine, Pork Belly, and anything with Foie Gras or Demi Glace.",
                "rating": 5,
                "createdAt": "2018-08-12T06:57:15.950Z",
                "updatedAt": "2018-08-12T06:57:15.950Z"
            },
            {
                "_id": "5b6fda4b9ed40513bc8a5730",
                "author": "Rich",
                "comment": "This sushi restaurant at the corner of Queen and Caroline is a take-out superstar. You can walk in to place your order or call ahead for pick up or delivery; they add a reasonable $3.00 delivery charge for the area nearby and $5.00 + for further surrounding areas, depending on the distance. If you call with special requests or large party orders, the chefs will accommodate you in a very timely manner - if it's not on the menu, just ask!\n\nJust like the fish, the interior is raw. There is actually one very small table with some chairs around it by the front window, but I've never seen anyone sitting there. There's a display that sits just to the left when you walk in, covered with bags of Japanese snacks for purchase and, on your right, you'll find shelves filled with a few groceries; dried sheets of nori is one recognizable item that jumps out immediately.\n\nChef John Lee has been serving up fresh and beautiful sushi platters at this location since 2005. It is impressive to note that he worked under the iron chef himself, Morimoto. There is something soothing about the fact that they prepare your food behind the counter in full view. It's that commitment to preparing and presenting the freshest ingredients that has built their dedicated customer base.\n\nLunch combos range from $15 to $25 and dinner combos from $15 to $35. If you choose the sashimi - individual pieces of raw fish with no rice - it does bring the price up a bit, but it's well worth it for something so delectable. If ordering a la carte is more your style, there are unique rolls to choose from, including: nigiri sushi (fish on rice), small rolls, inside out rolls and special rolls with everything from eel to sea urchin to marinated dried pumpkin.\n\nOur dinner for two was easily fulfilled with the vegetable sushi combo, which includes miso soup, and adding one Una Tekkyu roll (eel, tuna, cucumber, fish roe) and, my sushi must, an order of edamame. The vegetable rolls are prepped delicately to appear as if they too are made with tender slices of fish, the cucumber rolls are a refreshing addition and there is even a roll with an orange, crunchy vegetable called Burdock - carrot-like in appearance and texture, but with a different and unique flavour.\n\nTheir fresh ingredients are really the highlight. Nori can easily become chewy and tough, but Marche's is tender and graces the palate without even a hint of the unappealing sea-scent that you might get from a lesser sushi establishment. I have to say I'm not the biggest fan of the cold edamame they serve, but I wouldn't want to trek my raw fish home with something steaming hot resting on top of it anyway, so I don't mind this one pre-prepared item.\n\nIf your only sushi experience is picking up a pack of that generic grocery store stuff, with the fake green grass insert, Sushi Marche is really the place to discover all the glory of raw fish.",
                "rating": 4,
                "createdAt": "2018-08-12T06:57:15.950Z",
                "updatedAt": "2018-08-12T06:57:15.950Z"
            },
            {
                "_id": "5b6fda4b9ed40513bc8a572f",
                "author": "Peter",
                "comment": "I know St. Lawrence market is full of great food, but I never would've thought that tucked way in the back of the building I'd find something quite like Buster's Sea Cove.\n\nKeep in mind though, this takeout shop isn't Rodney's or Oyster Boy, and I'm definitely not trying to convince you that it is. In fact, Buster's Sea Cove isn't even in the same boat. At Buster's, you won't find soft lighting, romantic ambience, or table-side service, but what you're pretty much guaranteed to find, is some killer seafood served up really, really quickly.\n\nFresh-made fish and chips are the staple in this place, but they've got so much more than that. Their huge menu has everything from crab cakes and clam strips to fried oysters and fish-topped salads. And their fish-type sandwiches, something that they happen to do really, really well, are outstanding. I'm not talking about your standard old fried-fish-on-a-bun here; Buster's rivals the best seafood takeout places with crab cake paninis and seared tuna melts sandwiches.\n\nBut don't overlook the fish and chips either. This little takeout stand easily delivers one of the best plates of the stuff in the city. They've got a few varieties of fish to choose from, and each of them is served up expertly battered and crispy. Each plate of fish and chips also comes with in-house made fries and a killer slaw.\n\nBuster's also has a few other options you wouldn't expect from a takeout stand. Grilled swordfish, seafood bisque, rainbow trout, even octopus to name a few. It ain't fine dining by any means, but they truly do push the limits of what takeout is both in quality and selection.\n\nChances are though, once you get your food you'll be spending most of your time searching for a place to eat it. Busters only has 4 tables or so scattered around in front of the counter, but if those are full-and they probably will be-you're on your own. There's an exit close by to the Market's back patio and parking lot where most of Buster's customers end up, but trust me, if it's a nice day out, that'll fill up pretty quick too and you'll be left looking for a place to eat your by-then-getting-cold food.\n\nTruth be told though, even if you're standing out back of the market among parked cars and alleyways, it won't matter all that much. You might not even notice. Whether it's a crab cake sandwich or plate of fish and chips, the food at Buster's is just that dam good.",
                "rating": 4,
                "createdAt": "2018-08-12T06:57:15.950Z",
                "updatedAt": "2018-08-12T06:57:15.950Z"
            },
            {
                "_id": "5b6fda4b9ed40513bc8a572e",
                "author": "Rick",
                "comment": "3030 has young-professional written all over it. Craft beers, slightly pretentious menu and crowd, its Junction location (sigh, I remember the days when they avoided this area). And although I spend quite a bit of time in the neighbourhood, I only managed to getting around to checking it out a few days ago. That's mostly because it's a difficult place to notice, with an unassuming, simple '3030 stenciled on the front door, and not much else to identify it.\n\n3030 is huge inside... seriously huge; especially for a place in The Junction. Stuffed full of small table settings and 2 full bars, it seems more like you're in a concert hall than a neighbourhood restaurant, and that's with good intention. 3030 is built to be a live music venue that doubles as a food-venue, and in my opinion, not the other way around (although that's what they go for in the off hours).\n\nOne thing's for sure, they put a lot of thought into their draft selection. The back bar has taps full of local-ish craft brews, including Wellington, Beaus, and even some other, more difficult one's to find, like the Junction Craft Brewing's IPA (which was fantastic), a Sawdust City stout, and a Broadhead White. Clearly, they take their beer selection very seriously. The unfortunate thing about the bars though is that with no stools to sit on, you get the distinct that they don't want you hanging out there.\n\nMuch like you'd expect from a place aimed at young-pros in The Junction (sigh), the atmosphere sets it up as a pretty cool place to hang out, with shelves full of board games and walls lined with old-school pinball machines and plenty of interesting art. With the retro pinball machines all lit up in the evening, it gives the perfect backdrop to a night out.\n\nBut with just a little '5 dollar snack menu' card on each table, you wonder what about those of us that were there for more than snacks. Our server haphazardly and unconfidently rattled off the items they serve (there was only 4 of them at the time) but not before having to go back to the kitchen a couple of times before she could get it right. I asked if the items changed daily, hence no menus and the difficulty remembering them, but nope, these items had been here for a while she said. While it's cool to try items out to see what works, I hope that eventually they'll put together a more permanent and more expansive menu, or at least one that changes seasonally.\n\nBecause none of their mains sounded appealing to us, we instead opted for the items on the snack menu. The Butter Chicken Wings, while mostly tasty with the typical strong flavours you'd expect, arrived lukewarm. The Potato Wedges on the other hand, were indescribably and inedibly  hot, which turned out to be ok because they were bland and tasteless anyways. Overall, we just didn't find any of the items on the snack menu impressive at all.\n\nIf you're in the neighbourhood, 3030 may be worth checking out, but I'd say solely for their draft selection; and although the fact that there isn't much like it in the neighbourhood makes it the kind of place you want to check out, I'd wait until there is a concert or show you want to see before making the trek. In my opinion, it just isn't worth going out of your way for.\n\nWith a Gabby's now opened next door, I remember feeling a little upset for them having competition so close from some evil, corporate chain, but really, it's of little consequence. It's obvious right away that they'll both be attracting very different types of people.",
                "rating": 3,
                "createdAt": "2018-08-12T06:57:15.950Z",
                "updatedAt": "2018-08-12T06:57:15.950Z"
            },
            {
                "_id": "5b6fda4b9ed40513bc8a572d",
                "author": "Morty",
                "comment": "Hey Meatball! Hey Mediocre! Walking into Hey Meatball! instantly feels like you are walking into your old high school cafeteria. A few two and four person tables are set up, and there's one long 16 person table down the middle, all this in a space that was clearly not built for this many diners. I wasn't entirely sure if we were to seat ourselves or wait for direction. We inquired with the cashier/order taker/owner to find out. I know he was the owner because he told us.\n\nFor a restaurant that serves all meatballs, all the time, we were surprised to find that there were only three entrée selections on the chalk board and a few side dishes to choose from. Of the four side dishes, two had already been crossed out for the day, leaving a side salad or butternut squash soup. I decided to order the vegetarian eggplant 'meatballs' with polenta and parmesan, and my dining partner ordered the Porky  meatballs, (a combination of pork and ground beef) with tomato sauce on spaghetti. Immediately I was told that they were out of polenta and was asked \"what would I like it on?\" Unsure of my options, even after asking, I replied with \"spaghetti,\" as that was the only thing on the chalkboard that I was sure that they had in stock.\n\nWe each ordered a homemade cream soda, we were given a number, and we took a seat. Our number was called out about 10 minutes later, and we immediately noticed the disparity in portion size. My eggplant 'meatballs' were served on a huge swirl of very al dente spaghetti, whereas the porky meatballs arrived on what could be considered an order from the children's menu- if there was one that is.\n\nThe food was good, but not great. The eggplant 'meatballs' had a nice consistency, and were spicy and full of flavor. The tomato sauce that the dish was served with was hearty and not too salty, however I thought that the pasta could have been cooked a little more. The Porky meatballs were excellent, the combination of pork and beef proved to be a hit, however we both found that the tomato sauce served with the meatballs was far too sweet for the savory nature of the dish.\n\nThe saving grace of the meal was the amazing cream sodas they make fresh on site. They were a throwback to the Jones cream soda that you used to drink as a kid, but without too much fizz. Unfortunately, when the beverage you order to go with your meal is the best part of the experience, you know that there is something missing.\n\nHey Meatball! is missing the warm and friendly atmosphere you would expect to find in a restaurant with a wide open kitchen, communal tables and a chef that endeavors to use ingredients within a 100-mile radius of Toronto. All great qualities to have in a unique restaurant with a unique concept, but here, it just didn't seem to create anything memorable. There was no music playing while we were in, and the gruff reception and fluorescent lighting that made it a little harsh on the eyes made Hey Meatball! mostly a letdown.",
                "rating": 2,
                "createdAt": "2018-08-12T06:57:15.950Z",
                "updatedAt": "2018-08-12T06:57:15.950Z"
            }
        ],
        "createdAt": "2018-08-12T06:57:15.953Z",
        "updatedAt": "2018-08-12T06:57:15.953Z",
        "__v": 0
    },
    {
        "label": "",
        "featured": false,
        "_id": "5b6fda4b9ed40513bc8a5732",
        "name": "ElaiCheese Cake",
        "image": "images/003.png",
        "category": "dessert",
        "price": 299,
        "description": "A delectable, semi-sweet New York Style Cheese Cake, with Graham cracker crust and spiced with Indian cardamoms",
        "comments": [
            {
                "_id": "5b6fda4b9ed40513bc8a5737",
                "author": "Rick",
                "comment": "Bar Salumi is the unassuming sister bar-come-restaurant to The Local Kitchen in Parkdale.  It might be a little too unassuming for its own good, as many people seemed to question its whereabouts when I mentioned its name...but maybe Bar Salumi doesn't like the spotlight.  Indeed, its sign is almost an afterthought, with the store's original signage for an antique shop, dominating the storefront.\n\nMy friend and I had been meaning to go ever since she discovered they served Burrata pizza.  She really has a thing for that cheese, and I can't say I blame her. It's delicious.  We went awhile back, excited at the prospect of this new twist on a Margharita pie, only to find out the chef was on vacation and they were only serving up the liquid portion of their menu.  Normally I wouldn't have a problem with this, and in some cases I would actually prefer it, but that night we were hungry and consequently, deflated. My friend entered the chefs ETA in her phone, and we vowed to return.\n\nTwo weeks later, the alarm sounded, reminding us that the chef was back to work (and also that she had golden potatoes ready to harvest in Smurf Village).  We went the very next day.\n\nAs it was on our previous visit, Bar Salumi was quiet and dark, illuminated by flickering chandeliers (leftovers from the former antique shop maybe?) and tea light candles housed within mason jars.  Hanging legs of prosciutto fight for space with ceiling fans, and a boar's head watches diners from high above on the back wall.  I know it might not sound like it (what with the strong presence of dangling cured meat and taxidermy) but it has a real romantic vibe happening.\n\nThere is no kitchen at Bar Salumi, so our personable apron-clad server was also our chef.  The menu is a small one, focused on pizza and apps, so diners can watch as everything is prepared behind the bar. It did get a bit hot, what with the pizza oven operating from within the same room, but think how cozy that would be on a winter's night.\n\nThe menu is presented on the wall in cafeteria style (or bowling alley) fashion, with those little plastic letters that slide in and out, and I half expected to see nachos and cheese listed somewhere.  More menus were brought to us on mini clipboards, and because the food menu was unnecessary as we had fully rehearsed our order, we paused awhile over the drink list.  They offer a thoughtful selection of reds and whites as well as some interesting cocktails.  We went with two glasses of Malbec ($12 each) to go with our starter of olives & nodini with ricotta salata ($4).  So far so good, except that I couldn't help but think the nodini crackers weren't the most functional choice for the cheese...more like basketball hoops for the olives.\n\nOur pizza ($14), although not wood-fired, did come served on a cross-section of a tree trunk.  With the creamy white Burrata blending with the red of the San Marzano tomatoes, punctuated by basil it was like an homage to the Italian flag.  I wish I could say that the Burrata we were so looking forward to, made it the penultimate Margharita experience, but it was like any other made with Bufala.  The two are from the same family after all, so I'm not sure what we were thinking.  Cheese does things to people.  That being said however, we weren't disappointed, as the sauce was tangy, the crust was crispy, and it was big enough for both of us to eat and still take home leftovers.\n\nI wouldn't rank the pizza with the likes of pie giants, Terroni or Libretto, but Bar Salumi is rife with ambience where the aforementioned aren't.  The promise of Buratta may have lured me in the first time, but it's the character that will bring me back.",
                "rating": 4,
                "createdAt": "2018-08-12T06:57:15.950Z",
                "updatedAt": "2018-08-12T06:57:15.950Z"
            },
            {
                "_id": "5b6fda4b9ed40513bc8a5736",
                "author": "Morty",
                "comment": "The Duke of Kent serves up traditional pub food in a cozy spot at the corner of Yonge and Eglinton.  Kent is just one of a series of 'Duke Pubs' scattered around Toronto, and judging from the fairly comprehensive website, each has a slightly different décor, but all of them seem to tap into that English corner pub ambience.\n\nAfter a long week at work, I was on the hunt for a casual space to grab a pint, enjoy some hearty food, and catch up with some friends; the Duke of Kent was a great choice...for the most part.\n\nI snagged a corner booth with my dinner group on a busy Friday night.  When we first walked in, it seemed hopeless. We wanted dinner, but there was nary a table to be seen.  The staff did everything they could to make a space for us so we weren't forced back out into the cold to one of the other countless restaurants in the area.  That is what service is all about, and we were happy to stay.  Many thanks to the serving staff for being so accommodating on a hopping Friday night!\n\nAs for the food, it is the expected and welcomed pub spread.  They offer up fish & chips (yes, served in a basket on paper), pot roast and potatoes with buttered peas, and even bangers and mash.  You will find an array of reasonably priced English pub food on the menu, with entrees coming in at about $12 across the board.\n\nAs I've said before, I tend to go for the specials, and that night it was Moroccan Stew.  Unfortunately, I am sad to say it was disappointing.  The dish was somewhere between a curry and a Mexican chili, and I was given a healthy serving for the $12.99 price-point.  But, I couldn't help but become envious of those around me who had gravy-topped pot pies, crispy fish and chips, beefy burgers and gooey quesadillas.  I probably would not have been as put-off by the it if it was labelled on the menu, as it was on my bill - just 'vegetable stew'.  It was not as exotic as the name lead me to believe, and with a delicious-looking curry dish on the main menu, I expected more spice and life in my 'Moroccan' Stew special.\n\nFor a visit to the Duke, I suggest going full-English.  I saw enough plates of fish and chips go by to convince me that it is a popular item, and how much more traditional can you get than that?  Also, I have the 'famous' deep-fried pepperoni targeted - it has to be famous for a reason!\n\nAt the end of it all, the Duke of Kent draws in a wonderfully lively crowd, and provides a great atmosphere and service, albeit a bit slow - but hey, it was busy!  My food may have only been so-so, but the brew was cold, and my night was great.",
                "rating": 3,
                "createdAt": "2018-08-12T06:57:15.950Z",
                "updatedAt": "2018-08-12T06:57:15.950Z"
            },
            {
                "_id": "5b6fda4b9ed40513bc8a5735",
                "author": "Stacey X Joe",
                "comment": "Cool little place, nice atmosphere and staff. Great coffee too, go check em out!",
                "rating": 5,
                "createdAt": "2018-08-12T06:57:15.950Z",
                "updatedAt": "2018-08-12T06:57:15.950Z"
            },
            {
                "_id": "5b6fda4b9ed40513bc8a5734",
                "rating": 4,
                "comment": "Ultimate, Reaching for the stars!",
                "author": "Ringo Starry",
                "createdAt": "2018-08-12T06:57:15.950Z",
                "updatedAt": "2018-08-12T06:57:15.950Z"
            },
            {
                "_id": "5b6fda4b9ed40513bc8a5733",
                "author": "Tony",
                "comment": "As a group of new Toronto recruits, we decided to try out Rebel House at the suggestion of one of my coworkers. An easy walk from the Rosedale subway stop, we went the evening of the Stanley Cup final, expecting the place to be packed, but managed to find comfortable high-top seating, and friendly service, amidst a fairly busy night.\n\nThe Rebel House is a small pub, with a quaint upstairs section, where we sat. Several TV's aired the hockey game, and there was an eclectic mix of people, some older, into their 50's, but predominantly a mix of twenty and thirtysomething young professionals and students.\n\nThe menu is varied, but small, although they offer a revolving door of several daily specials that seem to be based on season and availability, which is always a good bet.\n\nMy dining partner decided to go with the daily special Mussels ($14), absolutely delicious in a white wine and garlic sauce, with toasted garlic bread. I ordered the Spicy Spinach Cheese Pennies ($10), small appetizer-sized cheese patties, with nary a spinach leaf in sight...nor were they spicey. No matter. These delightful little morsels were crispy on the outside, gooey on the inside, and came with a delectable tomato chutney and sour cream to top with. At our server's suggestions, I also ordered the Spinach and Apple Salad ($6), with cheddar cheese, toasted almonds, and a homemade maple dressing on the side. A wonderful combination. In fact, we liked the cheese pennies so much, we ordered another batch, only to find that that a repeat order isn't always as good the second time around. These pennies were so thick with grease, I found myself soaking up the oil slick with a napkin just to get them down. I think ordering a third time might have settled this dilemma for good, but for now I choose to remember the experience based on my initial encounter with the Spicy Spinach Cheese Pennies; delightful.\n\nMy dining partner, an \"adventurous\" drinker himself, ordered a Labatt Blue, but it did come in the extra large bottle, which made him smile from ear to ear. I ordered the Henry of Pelham Pinot Noir to start, but must admit that it tasted watered down and a bit weak. Not to be discouraged, I tried the 2006 Cabernet Franc Special Reserve VQA after dinner, and was pleasantly surprised by one of the nicer glasses of wine I have had at a pub in some time. It had a heavy quality, with a nice vanilla finish. I would go back to Rebel House just to try this glass of wine again.\n\nOur server was friendly and talkative, and the prices at Rebel House are fairly reasonable. Wine was about $7-$8 a glass, and our meals were between $8-$12 for the appetizers, and up to $20 for an entrée. Except for the bad experience with the second order of cheese pennies, Rebel House is an excellent neighbourhood pub, serving up good food at good prices.",
                "rating": 3,
                "createdAt": "2018-08-12T06:57:15.950Z",
                "updatedAt": "2018-08-12T06:57:15.950Z"
            }
        ],
        "createdAt": "2018-08-12T06:57:15.953Z",
        "updatedAt": "2018-08-12T06:57:15.953Z",
        "__v": 0
    },
    {
        "label": "",
        "featured": false,
        "_id": "5b6fda4b9ed40513bc8a5738",
        "name": "Apple Cake",
        "image": "images/004.png",
        "category": "dessert",
        "price": 299,
        "description": "A delectable, semi-sweet New York Style Cheese Cake, with Graham cracker crust and spiced with Indian cardamoms",
        "comments": [
            {
                "_id": "5b6fda4b9ed40513bc8a573a",
                "author": "Tom",
                "comment": "One of the worst bar experiences I've ever had. The servers don't care if you're there, and they probably wouldn't care if you showed up at all. They're far too busy chatting with each other about how beautiful and amazing and important they are to care about customers. Avoid...",
                "rating": 1,
                "createdAt": "2018-08-12T06:57:15.950Z",
                "updatedAt": "2018-08-12T06:57:15.950Z"
            },
            {
                "_id": "5b6fda4b9ed40513bc8a5739",
                "author": "Rick",
                "comment": "I know some people are going to completely disagree with my 1 star rating here, and to be honest, 10 years ago I would have thought the same; but considering how much the culture of Greek food on the Danforth has evolved in the past 10 years, Mr Greek seems to have been left far, far behind.\n\nMr Greek has slid to becoming nothing more than a glorified cafeteria. That might actually be giving it more credit than it deserves though, because I've been to some cafeterias that aren't absolutely horrible.\n\nI remember stopping in there in the past and having some pretty decent souvlaki, but what you're presented with now is nothing close to decent. The souvlaki is tough and tasteless, the rice is lukewarm and overcooked, the vegetables were likely previously frozen; bottom line is, this is in no way an accurate representation of what Greek food is in Toronto. Add in the sweaty, pushy serving staff, and you have an all around poor dining experience.\n\nI actually complained via email last time I went, and I promptly received an email back from the owner full of profuse apologies and promises of a better meal, nicer service and an overall better experience if I returned. Although I appreciated his effort, the last thing I want is to be forced another meal there. I know restaurants can have a bad day, and I'm willing to overlook that. But from what I saw, this was just another day in the life of crappy restaurant living of it's achievements in the distant past.\n\nOn a street with as many options as the Danforth, there's absolutley no reason (or excuse!) to end up in this joint.",
                "rating": 1,
                "createdAt": "2018-08-12T06:57:15.951Z",
                "updatedAt": "2018-08-12T06:57:15.951Z"
            }
        ],
        "createdAt": "2018-08-12T06:57:15.953Z",
        "updatedAt": "2018-08-12T06:57:15.953Z",
        "__v": 0
    },
    {
        "label": "",
        "featured": false,
        "_id": "5b6fda4b9ed40513bc8a573b",
        "name": "Pine Cake",
        "image": "images/005.png",
        "category": "dessert",
        "price": 299,
        "description": "A delectable, semi-sweet New York Style Cheese Cake, with Graham cracker crust and spiced with Indian cardamoms",
        "comments": [
            {
                "_id": "5b6fda4b9ed40513bc8a573d",
                "author": "Rick",
                "comment": "I heart churros.  At least that's what the button said that was given to me by the man behind the counter at Pancho's Bakery.  After noticing the small collection I have attached to both my bag and jacket, he was quick to give me a new addition.  I was hesitant to let it join the ranks, after all \"I heart\" anything is a pretty bold statement, and to be honest, as of that moment, I had never had a mind blowing churro experience, or at least one that would have me declaring such strong feelings for them.  The only time I ever ate a churro was at an establishment once promoted by a talking Chihuahua, so you can understand my hesitation.  I pocketed the button, as its fate would be determined later.\n\nPancho's Bakery makes up a portion of what is titled the Latin American Food Court in Kensington Market.  The tiny little storefront on Augusta Avenue is deceiving, as it houses more businesses than I would have guessed.  Assuming it was only Pancho's in the building, I was surprised (and excited) to see a stall selling tacos, another dealing in empanadas, and the infamous pop-up Agave y Aguacate.  Pancho's itself occupies the space right up front, across from the Korean dumpling stand... I'm not sure exactly how they fit in.  Apparently the Latin American Food Court doesn't discriminate, and why should they?  Dumplings are tasty, and well, I'm sure another vendor only helps pay the rent.\n\nIt was around twelve o'clock on a Friday when my friend and I decided to check out Pancho's. Neither of us had eaten, but we couldn't quite justify having churros for lunch. We are of the mindset however, that believes dinner shouldn't be the only meal followed by dessert, so our afternoon repast that day would have a churro chaser.\n\nFull of carnitas tacos, and kimchi empanadas (Korean dumpling cart influence!), but not too full to pass up deep-fried dough, we made our way back to Pancho's.  I was promptly questioned as to the whereabouts of my button but I quickly placed my order as a distraction.\n\nThe churros at Pancho's are piped out in the front window, and brought to life for all too see, before quickly being led to their delicious demise in the deep fryer.  They are served hot, either plain or filled with your choice of chocolate, dulce de leche or strawberry syrup.  We ordered four, one of each flavour, and a plain.  At my servers recommendation I also grabbed some bread pudding and traditional Mexican concha bread.  As we had lost our seats (there aren't many to begin with) and the sun was shining, we took our treats to go.\n\nWe started with the chocolate, moved on to the dulce de leche, followed by the strawberry, and thus ended anticlimactically with the plain. They were crispy and sugar coated on the outside, while soft and (with the exception of the plain) accompanied with a burst of sweetness from within. Churro rookies be warned... a churro is a like a deep fried dough straw.  Any filling that goes in the top, will ultimately come out the bottom.  We left a sticky trail through the streets of Kensington that led back to Pancho's.  If Hansel and Gretel only knew about these, they would have rethought the breadcrumb idea.\n\nLater at home, I popped the bread pudding and concha into the oven.  Concha is a sweet bread that resembles a clam shell, hence the name.  It tasted a little of brown sugar, but overall it was bland.  I think the idea however is to serve it alongside a cup of café con leche or hot chocolate and get to dunking.  I could see this working in its favour.\n\nThe bread pudding however (traditionally served around this time of year to be eaten for Lent) was delicious.  Dense, but very moist, and just sweet enough, my girlfriend went nuts over it. Apparently she doesn't have a problem with dessert after other meals either - and this time it was breakfast.\n\nNow I'm not a fan of donuts, and the churro is essentially the donuts Spanish cousin, but I would take a Pancho's churro over a donut any day, and these are what I will return for.  As it turns out, I really do \"heart\" churros after all.  Now where did I put that button?",
                "rating": 3,
                "createdAt": "2018-08-12T06:57:15.951Z",
                "updatedAt": "2018-08-12T06:57:15.951Z"
            },
            {
                "_id": "5b6fda4b9ed40513bc8a573c",
                "author": "Jonathan",
                "comment": "Great for the price, only $25 for long hair! Was hesitant about dry cut but it turned out good!",
                "rating": 4,
                "createdAt": "2018-08-12T06:57:15.951Z",
                "updatedAt": "2018-08-12T06:57:15.951Z"
            }
        ],
        "createdAt": "2018-08-12T06:57:15.953Z",
        "updatedAt": "2018-08-12T06:57:15.953Z",
        "__v": 0
    },
    {
        "label": "",
        "featured": false,
        "_id": "5b6fda4b9ed40513bc8a573e",
        "name": "Blue Cake",
        "image": "images/006.png",
        "category": "dessert",
        "price": 299,
        "description": "A delectable, semi-sweet New York Style Cheese Cake, with Graham cracker crust and spiced with Indian cardamoms",
        "comments": [
            {
                "_id": "5b6fda4b9ed40513bc8a5740",
                "author": "Morty",
                "comment": "Walk in to Famoso's new Annex location and there is no mistaking the kind of restaurant you have entered: a popular, loud hang out for students, families and friends alike. It's a casual place with daily deals (movies, cheap wine on Wednesdays, etc.), TVs showing Blue Jays' games and young staff working feverishly to keep up with the sit-in and take-out clientele.  It's got a pleasant, relaxed vibe and people seemed to be rather enjoying themselves.\n\nOnce seated in our booth, we perused the menu and our lovely server explained how the restaurant works: you write down your order on the notepad provided, bring it up to the counter and hand it in. You can either pay right away or begin a tab. Any subsequent orders can be placed through the wait staff. I assume this method is effective for those in a hurry, but it did seem a little odd considering how often our server checked in on us. She also expounded upon the \"red sauce\" pizzas made with Campania tomato sauce, fior-de-latte mozzarella, basil and pecorino romano cheese. (The \"white sauce\"pizzas are made with a garlic and olive oil sauce instead of the tomatoes.)\n\nWe opted for the prosciutto-wrapped mozzarella balls for an appetizer, the funghi tartufo and San Andreas pizzas and, for dessert, the dolce and banana dish. As with any self-respecting pizza place, they had San Pellegrino on the menu so got an Aranciata (my fave) and a Limonata. My dining companion kindly took the order the counter while I scoped out the huge place before me. Famoso has really nice exposed brick walls, comfortable booths and, by my count, at least three staff members per table. There are a lot of eyes on tables and not much gets missed. The staff is universally nice, if perhaps inexperienced. It lacked a certain finesse, but made up for it in sweet charm.\n\nOur appetizer arrived and I'm glad we asked for salt, pepper and chili flakes. The mozzarella balls were tasty, but the red sauce (which would appear later on our funghi pizza) was very, very sweet. For my liking, too sweet.  A dash of salt and some chili flakes were necessary and helped considerably. I was hoping for crispier prosciutto, too; as a start to the meal, it was pretty average. If you're going to get an appetizer, I would recommend you try a salad. They looked fresh and tasty.\n\nOur funghi  tartufo pizza arrived fairly shortly afterward. It consisted of roasted white mushrooms, oyster mushrooms, truffle oil and parmiggiano reggiano.  Again, it was better with the salt and chili flakes.  The crusts at Famoso are a bit thicker than is the trend right now, but I liked the chewier texture. I only wish that this pizza had been left in the 900-degree oven a little longer as it needed a little more crispiness to counter the soft, melting cheese that was starting to soak through the crust. (A note: I took a slice of this one home and had it two days later. I have to say, it tasted much better as a leftover!)\n\nOur second pizza - the San Andreas - was a \"New World Pizza\" with a white sauce, chili-lime marinated chicken and fresh mozzarella. It was then baked and topped with avocado slices, diced roma tomatoes, onion, cilantro, a drizzle of cream and a lime wedge. Certainly not traditional, but pretty darned tasty. The pizza seemed to have stayed in the oven just that little bit longer and had that nice char on the bottom. The lime juice provided a bright flavour and the chicken was tender. (I'd have liked a little more chicken, but that's a bit of a nitpick. It was a good pizza.) Were I to go back, I would steer my companions toward it if they wanted to try something a little different.\n\nFinally, dessert. This was my favourite dish of the four we tried. A long, rectangular plate of roasted bananas coated in caramelized brown sugar, topped with pecans and caramel sauce and a scoop of ice cream in the middle arrived at the table and my eyes widened. This looked and smelled fantasti and tasted even better. The bananas were piping hot and creamy and contrasted beautifully with the crunch of the sugar and the chill of the ice cream. That dish was devoured in what had to be record time.\n\nOverall, Famoso is...fine. There isn`t anything in particular that stands out but there isn't anything egregiously wrong with it, either.  It caters to a wide variety of tastes so it is sure to be a good option if you are going out with a group with varying tastes or dietary restrictions or preferences. Do not bother with the prosciutto-wrapped mozzarella balls, but do not skip dessert.",
                "rating": 2,
                "createdAt": "2018-08-12T06:57:15.951Z",
                "updatedAt": "2018-08-12T06:57:15.951Z"
            },
            {
                "_id": "5b6fda4b9ed40513bc8a573f",
                "author": "Rick",
                "comment": "La Revolucion is amazing! Well no, it isn't, but that's exactly how I wanted to start this off. Man, I really wanted to love this place. La Revolucion just looks so dam cool, that I figured the whole experience was going to be amazing. When I was first drawn by the interesting front stained-glass window and poked my head inside to look around, I figured that in no-time-at-all, there'd be a lineup to get in. Sadly, I don't think that's going to be the case anytime soon.\n\nLa Revolucion is a Mexican restaurant, but at first glance, it certainly doesn't scream Mexican; after eating there, I'm not even sure that's what they're going for. It's a sparsely decorated joint that for some reason--at least while I was there--feels the need to distance themselves even more from their Mexican roots by blasting annoyingly loud rave music. I mean, their food is the typical, standard Mexican fare you'd expect, like enchiladas and tacos and burritos, but other than that and the few Mexican-esque decorations, there wasn't much Mexican about it at all.\n\nThey're heavily pushing the banditos aspect of Mexican culture, which is actually a pretty cool gimic in my eyes. While I get the whole concept of banditos and revolution, it seemed as though La Revolucion fell a little short of their delivery of the theme. While what little decor they have there is mostly bandito-related, the rest of the theme is left to interpretation. La Revolucion does feel as though they're finding their identity, but they have a lot of difficulty conveying what that identity is exactly to their guests. Sitting there, it doesn't feel as though you were part of the revolution, it feels as though you're interrupting them while they plan it, and they can't wait for you to leave so they can get back down to business.\n\nPresentation isn't their strong point either. They haphazardly slap the food down on the plate, without much concern for appearances. My enchiladas were slightly warm and covered in tasteless green salsa; my burrito was humungous, but it was bland and not nearly warm enough. When I asked for hot sauce, because it was nowhere to be found, I got a small ramekin with some sort of sauce, but it's details remained a mystery that was left for me to find out with no explanation from the server, and while you're waiting for that stuff to all arrive, there's no offer of chips and salsa or even water for that matter, which would have definitely improved the experience.\n\nInterestingly enough, before this place was a Mexican place it was, well, a Mexican place. Whoever it is that owns it probably just decided it was time to rebrand, and while that may have been a great idea on their part, the execution of their new brand and concept needs some polishing because it's hard to tell exactly what the concept is. La Revolucion may be a restaurant, but a revolution it is not.",
                "rating": 2,
                "createdAt": "2018-08-12T06:57:15.951Z",
                "updatedAt": "2018-08-12T06:57:15.951Z"
            }
        ],
        "createdAt": "2018-08-12T06:57:15.953Z",
        "updatedAt": "2018-08-12T06:57:15.953Z",
        "__v": 0
    },
    {
        "label": "",
        "featured": false,
        "_id": "5b6fda4b9ed40513bc8a5741",
        "name": "Red Cake",
        "image": "images/007.png",
        "category": "dessert",
        "price": 299,
        "description": "A delectable, semi-sweet New York Style Cheese Cake, with Graham cracker crust and spiced with Indian cardamoms",
        "comments": [
            {
                "_id": "5b6fda4b9ed40513bc8a5743",
                "author": "Stacey X Joe",
                "comment": "Of the several places to get bagels in Oakland, these bagels are the best. Really fresh and tasty and they taste homemade.\n\nHowever, I wasn't crazy about their bagel and egg sandwiches.",
                "rating": 4,
                "createdAt": "2018-08-12T06:57:15.951Z",
                "updatedAt": "2018-08-12T06:57:15.951Z"
            },
            {
                "_id": "5b6fda4b9ed40513bc8a5742",
                "author": "Rick",
                "comment": "The Rotisserie House is a family-run, Portuguese barbeque (or Churrasqueira) restaurant in the Liberty Village area. Like most places owned and run by families, this restaurant is small, a bit cluttered with a mishmash of décor and, no matter the number of other patrons there at the time, has a staff that makes you feel like the centre of attention.\n\nThey happen to be closed on the weekend, but from Monday to Thursday they are open from 11:00 a.m. to 7:30 p.m. and Fridays from 11:00 a.m. to 8:30 p.m. The hours are slightly odd, but it makes for a great lunch spot, especially for those like me who tend to take lunch anytime between about noon and 3:00 p.m.\n\nThey offer a variety of chicken dishes, a number of different sides and even one vegetarian option. You can get a 1/4 or 1/2 rotisserie chicken dinner - white meat or dark meat - with a choice of two small sides for $6.50 - $10.00. For an additional $0.99 (small) or $1.98 (double) you can get a side of onion rings, Greek or Caesar salad.\n\nThe menu itself is pretty huge and is filled with quite a few options. The regular roster of sides, for example, includes Portuguese rice, roasted Parisian potatoes, steamed vegetables, French fries, garden salad or potato wedges. Mains include the abovementioned chicken combos, rib combos, a variety of salads and soups, chicken wings and fingers and sandwiches, like pulled chicken, grilled vegetable, grilled chicken, pork or sausage. They even offer catering.\n\nI decided upon the pulled chicken sandwich with a side of Parisian potatoes. The pulled chicken is topped with their \"famous\" hot sauce, served on a white or whole wheat Kaiser and is dressed with mayo, lettuce and tomato. All of this, with a drink, came in at about $9.\n\nOne of my all-time favourite side dishes are those lemony, roasted potatoes available at most Greek restaurants. Well, The Rotisserie House's Parisian roasted potatoes are a close second. They are red, probably from Paprika, and just a bit fiery from the restaurant's signature hot sauce. The pulled chicken sandwich was flavourful, tender and also had the same red hue from the sauce.\n\nI do enjoy spicy foods, though I am a bit of a wimp. This restaurant's hot sauce had a great kick and a good flavour, but it won't burn your mouth to the point that you can't taste anything else. This is really important, since they throw the hot sauce on their dishes, whether it's requested or not. Don't fret too much about all the spice if you're grabbing lunch and heading back to the office, you can buy a pack of gum here too!\n\nConsidering the size of this restaurant, I was quite surprised by the number of items they have on the menu. It was not overly busy when I walked in, so everything went very smoothly as far as timing and service went. The staff is extremely friendly, but very small, so I am curious to see what happens when it gets really busy. However, they seem to have it all figured out.\n\nIf I lived closer to Liberty Village, I could see this being a regular staple for me for a quick lunch, or to grab some dinner on the way home from work. The prices are reasonable, the food tastes good and it's quick and satisfying.",
                "rating": 3,
                "createdAt": "2018-08-12T06:57:15.951Z",
                "updatedAt": "2018-08-12T06:57:15.951Z"
            }
        ],
        "createdAt": "2018-08-12T06:57:15.953Z",
        "updatedAt": "2018-08-12T06:57:15.953Z",
        "__v": 0
    }
],
  "promotions": [
    {
      "id": 1,
      "name": "Weekend Grand Buffet",
      "image": "images/buffet.png",
      "label": "New",
      "price": "19.99",
      "featured": "true",
      "description": "Featuring mouthwatering combinations with a choice of five different salads, six enticing appetizers, six main entrees and five choicest desserts. Free flowing bubbly and soft drinks. All for just $19.99 per person "
    }
  ],
  "leaders": [
    {
      "id": 0,
      "name": "Gavin",
      "image": "images/Gavin.png",
      "designation": "Chief Epicurious Officer",
      "abbr": "CEO",
      "featured": "false",
      "description": "Our CEO, Gavin, Gavin Belson was the Chief Innovation Officer of Hooli, a huge tech company in Silicon Valley that seemingly has its hands in everything but specifically does “targeted search and cross-platform verticals.”"
    },
    {
      "id": 1,
      "name": "Erlich",
      "image": "images/Erlich.png",
      "designation": "Chief Food Officer",
      "abbr": "CFO",
      "featured": "false",
      "description": "Erlich administers the Hacker Hostel, a tech incubator where Richard, Big Head, Dinesh, and Gilfoyle live and work in exchange for 10 percent of their potential businesses."
    },
    {
      "id": 2,
      "name": "Gilfoyle",
      "image": "images/Gilfoyle.png",
      "designation": "Chief Taste Officer",
      "abbr": "CTO",
      "featured": "false",
      "description": "Gilfoyle lives and works in the Hacker Hostel with Richard, Big Head, and Dinesh. He is pompous and purports to be good at system architecture, networking, and security. Gilfoyle often finds himself sparring with Dinesh about things such as their work efficiency, Dinesh's Pakistani ethnicity, Gilfoyle's religion along with other negligible matters."
    },
    {
      "id": 3,
      "name": "Richard",
      "image": "images/Richard.png",
      "designation": "Executive Chef",
      "abbr": "EC",
      "featured": "true",
      "description": "Richard invented and built the start-up Pied Piper, a program designed to find music matches, while living at Erlich’s Hacker Hostel alongside his best friend Big Head and fellow geeks Dinesh and Gilfoyle."
    }
  ],
  "feedback": [
    {
      "firstname": "Tony",
      "lastname": "Lee",
      "telnum": "12345678",
      "email": "asd@gmail.com",
      "agree": false,
      "contacttype": "None",
      "message": "good",
      "id": 1
    }
  ]
}
